tutorials/FF/dambreak/swe-of_supercritical/interFoam_solver_swe-of_supercritical/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "precice-config.xml";

participant interFoam_solver_swe-of_supercritical;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              interFoam_solver_swe-of_supercritical-Mesh;
    patches           (leftWall_inlet);

    readData
    (
      Alpha
      Velocity
    );

    writeData
    (
    );
  };
};
